DELETE FROM user_role;
DELETE FROM meals;
DELETE FROM users;

ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_role (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO meals (date_time, description, calories, user_id)
VALUES ('2023-02-19 09:39:00', 'завтрак', 200, 100000),
       ('2023-02-19 14:40:00', 'обед', 700, 100000),
       ('2023-02-19 18:41:00', 'ужин', 1000, 100000),
       ('2023-02-19 22:19:00', 'полдник', 100, 100000),
       ('2023-02-20 10:03:00', 'завтрак', 500, 100000),
       ('2023-02-20 13:52:00', 'обед', 1200, 100000),
       ('2023-02-20 18:39:00', 'ужин', 600, 100000),
       ('2023-02-20 22:40:00', 'перекус', 700, 100000),
       ('2023-02-19 09:39:00', 'завтрак', 600, 100001),
       ('2023-02-19 14:40:00', 'обед', 1000, 100001),
       ('2023-02-19 18:41:00', 'ужин', 600, 100001),
       ('2023-02-19 22:19:00', 'полдник', 200, 100001),
       ('2023-02-20 10:03:00', 'завтрак', 700, 100001),
       ('2023-02-20 13:52:00', 'обед', 1100, 100001),
       ('2023-02-20 18:39:00', 'ужин', 700, 100001),
       ('2023-02-20 22:40:00', 'перекус', 400, 100001);